# YOLOv13m - Medium variant (good balance of speed and accuracy)
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768]   # Medium (good balance)

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv,  [96, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [192, False, 0.75]]
  - [-1, 1, Conv,  [192, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2,  [384, False, 0.75]]
  - [-1, 1, DSConv,  [384, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [384, True, 4]]
  - [-1, 1, DSConv,  [768, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [768, True, 1]] # 8

head:
  - [[4, 6, 8], 2, HyperACE, [384, 6, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ 9, 1, DownsampleConv, []]
  - [[6, 9], 1, FullPAD_Tunnel, []]  #12     
  - [[4, 10], 1, FullPAD_Tunnel, []]  #13    
  - [[8, 11], 1, FullPAD_Tunnel, []] #14 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, DSC3k2, [384, True]] # 17
  - [[-1, 9], 1, FullPAD_Tunnel, []]  #18

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, DSC3k2, [192, True]] # 21
  - [10, 1, Conv, [192, 1, 1]]
  - [[21, 22], 1, FullPAD_Tunnel, []]  #23
  
  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P4
  - [-1, 2, DSC3k2, [384, True]] # 26
  - [[-1, 9], 1, FullPAD_Tunnel, []]  

  - [26, 1, Conv, [384, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 2, DSC3k2, [768, True]] # 30 (P5/32-large)
  - [[-1, 11], 1, FullPAD_Tunnel, []]  
  
  - [[23, 27, 31], 1, Detect, [nc]] # Detect(P3, P4, P5)